function [inverse_figure] = mark_the_figure_1024(X,marking,coff)

%小波变换
[c,s]=wavedec2(X,1,'haar');
[H1,V1,D1] = detcoef2('all',c,s,1);
A1 = appcoef2(c,s,'haar',1);

%水印
%[marking map]=imread('C:\Users\16000\Desktop\HDTT_water_1024_2.png');
marking=marking(:,:,1);
marking=imresize(marking,32/1024);
marking(marking~=255)=0;

%figure,imshow(marking);
marking_arnold=arnold(marking,8);
%figure,imshow(marking_arnold);
[height,width]=size(marking);
% Generating the pseudo random bit pattern for spreading
%伪随机序列
%coff=100;%强度
spread_sig_1=coff*[1;1;-1;1;1;-1;-1;1;1;1;1;-1;-1;-1;1;1;-1;1;-1;1;1;1;-1;-1;1;-1;-1;-1;-1;1;1;1;1;-1;1;1;1;-1;1;1;1;1;-1;1;-1;-1;-1;-1;-1;1;-1;-1;-1;-1;-1;-1;1;-1;1;1;-1;1;1;1;1;1;-1;-1;1;1;-1;1;1;1;-1;-1;-1;1;-1;1;1;1;-1;1;-1;-1;1;1;-1;-1;1;-1;1;-1;1;-1;1;-1;-1;1;-1;-1;1;-1;-1;-1;1;-1;1;-1;-1;-1;-1;1;-1;-1;1;1;-1;1;-1;-1;-1;1;1;1;1;1;-1;1;-1;1;1;-1;1;-1;-1;1;-1;1;-1;-1;1;1;1;1;1;1;-1;-1;-1;-1;-1;-1;-1;1;1;-1;1;1;-1;1;-1;1;-1;-1;-1;1;-1;-1;1;-1;1;1;1;1;-1;-1;1;-1;1;1;-1;-1;-1;1;-1;-1;-1;1;1;-1;-1;1;1;-1;-1;-1;1;1;1;-1;-1;-1;-1;1;1;-1;-1;-1;-1;-1;1;1;1;-1;1;1;-1;-1;-1;-1;1;-1;1;-1;1;1;-1;-1;1;-1;-1;1;1;1;-1;-1;1;1;1;-1;1;-1;1;-1;1;1;1;1;1;1;1;1;-1;1]';%[mseq(2,8,1,1);1]';%*[-1;0;0;-1;0;1;0;1;0;1;-1;0;0;0;0;0]';%mseq(2,3,2,1);
spread_sig_2=coff*[1;-1;1;-1;1;1;1;-1;-1;1;1;1;-1;-1;1;-1;-1;1;1;-1;1;-1;1;-1;-1;-1;-1;1;1;-1;1;1;1;-1;-1;-1;-1;-1;1;1;-1;-1;-1;-1;1;1;1;-1;-1;-1;1;1;-1;-1;1;1;-1;-1;-1;1;-1;-1;-1;1;1;-1;1;-1;-1;1;1;1;1;-1;1;-1;-1;1;-1;-1;-1;1;-1;1;-1;1;1;-1;1;1;-1;-1;-1;-1;-1;-1;-1;1;1;1;1;1;1;-1;-1;1;-1;1;-1;-1;1;-1;1;1;-1;1;-1;1;1;1;1;1;-1;-1;-1;1;-1;1;1;-1;-1;1;-1;-1;-1;-1;1;-1;1;-1;-1;-1;1;-1;-1;1;-1;-1;1;-1;1;-1;1;-1;1;-1;-1;1;1;-1;-1;1;-1;1;1;1;-1;1;-1;-1;-1;1;1;1;-1;1;1;-1;-1;1;1;1;1;1;-1;1;1;-1;1;-1;-1;-1;-1;-1;-1;1;-1;-1;-1;-1;-1;1;-1;1;1;1;1;-1;1;1;1;-1;1;1;1;1;-1;-1;-1;-1;1;-1;-1;1;1;1;-1;1;-1;1;1;-1;-1;-1;1;1;1;1;-1;-1;1;1;-1;1;1;-1;1;1;1;1;1;1;1;1;-1;1]';%[mseq(2,8,1,2);1]';%[0;0;1;-1;-1;0;-1;0;1;-1;0;0;0;1;0;1]';%mseq(2,3,2,4);

dsss_sig_total=[];
for j = 1:height
    dsss_sig=[];
    for k = 1:width
         if marking_arnold(j,k) == 0
             dsss_sig = [dsss_sig spread_sig_1];
         else
             dsss_sig = [dsss_sig spread_sig_2];
         end
    end
     dsss_sig_total = [dsss_sig_total;dsss_sig];    
end

dsss_sig_total_figure=[];
for i = 1:512:16*512%这里是为了凑成正方形,这样的话一行有两个方格
    dsss_sig_total_figure=[dsss_sig_total_figure;dsss_sig_total(1:32,i:i+511)];
end

marked_A1=dsss_sig_total_figure+A1;
marked_D1=D1;%dsss_sig_total_figure+D1;
marked_V1=V1;%dsss_sig_total_figure+V1;
marked_H1=H1;%dsss_sig_total_figure+H1;
inverse_figure = idwt2(marked_A1,marked_H1,marked_V1,marked_D1,'Haar');
